In [7]:
import pandas as pd
import numpy as np
import os
%matplotlib inline

In [8]:
df =pd.read_csv("IRIS1.csv")

In [9]:
df.head()

   sepal_length  sepal_width  petal_length  petal_width      species
0           5.1          3.5           1.4          0.2  Iris-setosa
1           4.9          3.0           NaN          0.2  Iris-setosa
2           4.7          3.2           1.3          0.2  Iris-setosa
3           4.6          3.1           1.5          0.2          NaN
4           5.0          3.6           1.4          0.2  Iris-setosa

In [10]:
df.tail()

     sepal_length  sepal_width  petal_length  petal_width         species
145           6.7          3.0           5.2          2.3  Iris-virginica
146           6.3          2.5           NaN          1.9  Iris-virginica
147           6.5          3.0           5.2          2.0             NaN
148           6.2          3.4           5.4          2.3  Iris-virginica
149           5.9          3.0           NaN          1.8  Iris-virginica

In [11]:
df.isnull()

     sepal_length  sepal_width  petal_length  petal_width  species
0           False        False         False        False    False
1           False        False          True        False    False
2           False        False         False        False    False
3           False        False         False        False     True
4           False        False         False        False    False
..            ...          ...           ...          ...      ...
145         False        False         False        False    False
146         False        False          True        False    False
147         False        False         False        False     True
148         False        False         False        False    False
149         False        False          True        False    False

[150 rows x 5 columns]

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   sepal_length  140 non-null    float64
 1   sepal_width   142 non-null    float64
 2   petal_length  137 non-null    float64
 3   petal_width   143 non-null    float64
 4   species       137 non-null    object
dtypes: float64(4), object(1)
memory usage: 6.0+ KB

In [12]:
df.describe()

       sepal_length  sepal_width  petal_length  petal_width
count    140.000000   142.000000    137.000000   143.000000
mean       5.833571     3.061268      3.713139     1.184615
std        0.841086     0.450035      1.791845     0.766031
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.500000     0.300000
50%        5.800000     3.000000      4.200000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.800000      6.900000     2.500000

In [13]:
df.shape

(150, 5)

In [20]:
df = pd.DataFrame(df,
                  columns = ['sepal_length', 'sepal_width', 'petal_length','petal_width','species'])
duplicate = df[df.duplicated(keep = 'first')]

In [21]:
print(duplicate)

     sepal_length  sepal_width  petal_length  petal_width         species
37            4.9          3.1           1.5          0.1     Iris-setosa
142           5.8          2.7           5.1          1.9  Iris-virginica

In [27]:
df = pd.DataFrame(df,
                  columns = ['sepal_length', 'sepal_width', 'petal_length','petal_width','species'])
duplicate = df[df.duplicated(keep = 'last')]

In [28]:
df.shape

(148, 5)

In [29]:
df.isnull().sum()

sepal_length    10
sepal_width      8
petal_length    13
petal_width      7
species         13
dtype: int64

In [31]:
df['sepal_length'].fillna(value=df['sepal_length'].mean(), inplace = True)

In [32]:
df.isnull().sum()

sepal_length     0
sepal_width      8
petal_length    13
petal_width      7
species         13
dtype: int64

In [33]:
df['sepal_width'].fillna(value=df['sepal_width'].mode().values[0], inplace = True)

In [34]:
df.isnull().sum()

sepal_length     0
sepal_width      0
petal_length    13
petal_width      7
species         13
dtype: int64

In [35]:
df['petal_length'].fillna(value=df['petal_length'].median(), inplace = True)

In [36]:
df.isnull().sum()

sepal_length     0
sepal_width      0
petal_length     0
petal_width      7
species         13
dtype: int64

In [37]:
df['petal_width'].fillna(value=0.1, inplace = True)

In [38]:
df.isnull().sum()

sepal_length     0
sepal_width      0
petal_length     0
petal_width      0
species         13
dtype: int64

In [39]:
df.isnull()

     sepal_length  sepal_width  petal_length  petal_width  species
0           False        False         False        False    False
1           False        False         False        False    False
2           False        False         False        False    False
3           False        False         False        False     True
4           False        False         False        False    False
..            ...          ...           ...          ...      ...
145         False        False         False        False    False
146         False        False         False        False    False
147         False        False         False        False     True
148         False        False         False        False    False
149         False        False         False        False    False

[148 rows x 5 columns]

In [40]:
df = df.dropna(axis = 0, how ='any')

In [41]:
print(df.isnull().sum())

sepal_length    0
sepal_width     0
petal_length    0
petal_width     0
species         0
dtype: int64

In [42]:
df.head()

   sepal_length  sepal_width  petal_length  petal_width      species
0           5.1          3.5           1.4          0.2  Iris-setosa
1           4.9          3.0           4.2          0.2  Iris-setosa
2           4.7          3.2           1.3          0.2  Iris-setosa
4           5.0          3.6           1.4          0.2  Iris-setosa
5           5.4          3.9           1.7          0.4  Iris-setosa

In [43]:
df.isnull()

     sepal_length  sepal_width  petal_length  petal_width  species
0           False        False         False        False    False
1           False        False         False        False    False
2           False        False         False        False    False
4           False        False         False        False    False
5           False        False         False        False    False
..            ...          ...           ...          ...      ...
144         False        False         False        False    False
145         False        False         False        False    False
146         False        False         False        False    False
148         False        False         False        False    False
149         False        False         False        False    False

[135 rows x 5 columns]